taylor/slip_slip/800/system/solverInfo
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

writeControl writeTime;

fields      (p_rgh);

writeFields yes;


// ************************************************************************* //
